RECORD 12-05-18 4.10.32 PM-Combined-JMeter-and-Selenium (1).yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: RECORD 12-05-18 4.10.32 PM-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: RECORD 12-05-18 4.10.32 PM-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  RECORD 12-05-18 4.10.32 PM-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://blazedemo.com/)
      - clickByName(fromPort)
      - selectByName(fromPort): "Philadelphia"
      - clickByName(fromPort)
      - clickByName(toPort)
      - selectByName(toPort): "Berlin"
      - clickByName(toPort)
      - clickByCSS(input.btn.btn-primary)

  RECORD 12-05-18 4.10.32 PM-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.110 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
      Referer: 'http://blazedemo.com/'
      Accept-Encoding: 'gzip, deflate'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://blazedemo.com/reserve.php'
            method: POST
            label: 'http://blazedemo.com/reserve.php'
            think-time: 0ms
            headers: {}
            body:
              fromPort: Philadelphia
              toPort: Berlin