RECORD 12-05-18 4.10.32 PM-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: RECORD 12-05-18 4.10.32 PM-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: RECORD 12-05-18 4.10.32 PM-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  RECORD 12-05-18 4.10.32 PM-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(https://www.google.co.in/search?q=wikipedia&rlz=1C1GCEB_enIN816IN816&oq=wiki&aqs=chrome.0.69i59j69i57j69i60l3j0.2076j0j4&sourceid=chrome&ie=UTF-8)
      - clickByCSS(h3.LC20lb)
      - go(https://www.wikipedia.org/)
      - clickByCSS(#js-link-box-en > strong)
      - go(https://en.wikipedia.org/wiki/Main_Page)
      - clickByID(mp-topbanner)
      - clickByID(mp-topbanner)
      - clickByLinkText(Log in)
      - clickByID(wpName1)
      - typeByID(wpName1): "azharw49"
      - clickByID(wpPassword1)
      - typeByID(wpPassword1): "Chelsea@1"
      - clickByID(wpLoginAttempt)

  RECORD 12-05-18 4.10.32 PM-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.110 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://www.wikipedia.org/'
            method: GET
            label: 'https://www.wikipedia.org/'
            think-time: 0ms
            headers:
              Referer: 'https://www.google.co.in/'
          - url: 'https://en.wikipedia.org/'
            method: GET
            label: 'https://en.wikipedia.org/'
            think-time: 4587ms
            headers:
              Referer: 'https://www.wikipedia.org/'
          - url: 'https://en.wikipedia.org/w/index.php'
            method: GET
            label: 'https://en.wikipedia.org/w/index.php'
            think-time: 27985ms
            headers:
              Referer: 'https://en.wikipedia.org/wiki/Main_Page'
            body:
              title: 'Special:UserLogin'
              returnto: Main Page
          - url: 'https://en.wikipedia.org/w/index.php?title=Special:UserLogin&returnto=Main+Page'
            method: POST
            label: 'https://en.wikipedia.org/w/index.php?title=Special:UserLogin&returnto=Main+Page'
            think-time: 16451ms
            headers:
              Origin: 'https://en.wikipedia.org'
              Content-Type: application/x-www-form-urlencoded
              Referer: 'https://en.wikipedia.org/w/index.php?title=Special:UserLogin&returnto=Main+Page'
            body:
              authAction: login
              force: ''
              title: 'Special:UserLogin'
              wpEditToken: "+\\"
              wpForceHttps: '1'
              wpFromhttp: '1'
              wpLoginToken: "3f58e58aa90faa5edfff705bf276c14d5c07ab43+\\"
              wpName: azharw49
              wpPassword: Chelsea@1
              wploginattempt: Log in
          - url: 'https://login.wikimedia.org/wiki/Special:CentralLogin/start'
            method: GET
            label: 'https://login.wikimedia.org/wiki/Special:CentralLogin/start'
            think-time: 1590ms
            headers:
              Referer: 'https://en.wikipedia.org/'
            body:
              token: 7130cb8832cfc67bf078ec352b4036b0